of90/tutorials/rheoFoam/CrossSlot/Oldroyd-BSqrt/0/b
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    object      b;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (1 0 0 1 0 1);

boundaryField
{

    inlet_north
    {
        type            fixedValue;
        value           uniform (1 0 0 1 0 1);
    }
    inlet_south
    {
        type            fixedValue;
        value           uniform (1 0 0 1 0 1);
    }
    walls
    {     
        type            zeroGradient;
    }  
    outlet_west
    {
         type           zeroGradient;
    }
    outlet_east
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
